RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.h
/********************************************************************//**
* @brief UART Interrupt Type definitions
**********************************************************************/
typedef enum {
    UART_INTCFG_RBR = 0,    /*!< RBR Interrupt enable*/
    UART_INTCFG_THRE,        /*!< THR Interrupt enable*/
    UART_INTCFG_RLS,        /*!< RX line status interrupt enable*/
    UART1_INTCFG_MS,        /*!< Modem status interrupt enable (UART1 only) */
    UART1_INTCFG_CTS,        /*!< CTS1 signal transition interrupt enable (UART1 only) */
    UART_INTCFG_ABEO,        /*!< Enables the end of auto-baud interrupt */
    UART_INTCFG_ABTO        /*!< Enables the auto-baud time-out interrupt */
} UART_INT_Type;

/**
 * @brief UART Line Status Type definition
 */
typedef enum {
    UART_LINESTAT_RDR    = UART_LSR_RDR,            /*!<Line status register: Receive data ready*/
    UART_LINESTAT_OE    = UART_LSR_OE,            /*!<Line status register: Overrun error*/
    UART_LINESTAT_PE    = UART_LSR_PE,            /*!<Line status register: Parity error*/
    UART_LINESTAT_FE    = UART_LSR_FE,            /*!<Line status register: Framing error*/
    UART_LINESTAT_BI    = UART_LSR_BI,            /*!<Line status register: Break interrupt*/
    UART_LINESTAT_THRE    = UART_LSR_THRE,        /*!<Line status register: Transmit holding register empty*/
    UART_LINESTAT_TEMT    = UART_LSR_TEMT,        /*!<Line status register: Transmitter empty*/
    UART_LINESTAT_RXFE    = UART_LSR_RXFE            /*!<Error in RX FIFO*/
} UART_LS_Type;

/**
 * @brief UART Auto-baudrate mode type definition
 */
typedef enum {
    UART_AUTOBAUD_MODE0                = 0,            /**< UART Auto baudrate Mode 0 */
    UART_AUTOBAUD_MODE1,                            /**< UART Auto baudrate Mode 1 */
} UART_AB_MODE_Type;

/**
 * @brief Auto Baudrate mode configuration type definition
 */
typedef struct {
    UART_AB_MODE_Type    ABMode;            /**< Autobaudrate mode */
    FunctionalState        AutoRestart;    /**< Auto Restart state */
} UART_AB_CFG_Type;

/**
 * @brief UART End of Auto-baudrate type definition
 */
typedef enum {
    UART_AUTOBAUD_INTSTAT_ABEO        = UART_IIR_ABEO_INT,        /**< UART End of auto-baud interrupt  */
    UART_AUTOBAUD_INTSTAT_ABTO        = UART_IIR_ABTO_INT            /**< UART Auto-baud time-out interrupt  */
}UART_ABEO_Type;

/**
 * UART IrDA Control type Definition
 */
typedef enum
{
    /** Pulse width = 2 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV2        = 0,

    /** Pulse width = 4 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV4,

    /** Pulse width = 8 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV8,

    /** Pulse width = 16 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV16,

    /** Pulse width = 32 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV32,

    /**< Pulse width = 64 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV64,

    /**< Pulse width = 128 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV128,

    /**< Pulse width = 256 * Tpclk
    - Configures the pulse when FixPulseEn = 1 */
    UART_IrDA_PULSEDIV256
} UART_IrDA_PULSE_Type;

/********************************************************************//**
* @brief UART1 Full modem -  Signal states definition
**********************************************************************/
typedef enum {
    INACTIVE = 0,            /* In-active state */
    ACTIVE = !INACTIVE         /* Active state */
}UART1_SignalState;

/**
 * @brief UART modem status type definition
 */
typedef enum {
    UART1_MODEM_STAT_DELTA_CTS    = UART1_MSR_DELTA_CTS,        /*!< Set upon state change of input CTS */
    UART1_MODEM_STAT_DELTA_DSR    = UART1_MSR_DELTA_DSR,        /*!< Set upon state change of input DSR */
    UART1_MODEM_STAT_LO2HI_RI    = UART1_MSR_LO2HI_RI,        /*!< Set upon low to high transition of input RI */
    UART1_MODEM_STAT_DELTA_DCD    = UART1_MSR_DELTA_DCD,        /*!< Set upon state change of input DCD */
    UART1_MODEM_STAT_CTS        = UART1_MSR_CTS,            /*!< Clear To Send State */
    UART1_MODEM_STAT_DSR        = UART1_MSR_DSR,            /*!< Data Set Ready State */
    UART1_MODEM_STAT_RI            = UART1_MSR_RI,                /*!< Ring Indicator State */
    UART1_MODEM_STAT_DCD        = UART1_MSR_DCD                /*!< Data Carrier Detect State */
} UART_MODEM_STAT_type;

/**
 * @brief Modem output pin type definition
 */
typedef enum {
    UART1_MODEM_PIN_DTR            = 0,        /*!< Source for modem output pin DTR */
    UART1_MODEM_PIN_RTS                        /*!< Source for modem output pin RTS */
} UART_MODEM_PIN_Type;

/**
 * @brief UART Modem mode type definition
 */
typedef enum {
    UART1_MODEM_MODE_LOOPBACK    = 0,        /*!< Loop back mode select */
    UART1_MODEM_MODE_AUTO_RTS,                /*!< Enable Auto RTS flow-control */
    UART1_MODEM_MODE_AUTO_CTS                 /*!< Enable Auto CTS flow-control */
} UART_MODEM_MODE_Type;

/**
 * @brief UART Direction Control Pin type definition
 */
typedef enum {
    UART1_RS485_DIRCTRL_RTS = 0,    /**< Pin RTS is used for direction control */
    UART1_RS485_DIRCTRL_DTR            /**< Pin DTR is used for direction control */
} UART_RS485_DIRCTRL_PIN_Type;

/********************************************************************//**
* @brief UART Configuration Structure definition
**********************************************************************/
typedef struct {
  uint32_t Baud_rate;           /**< UART baud rate */
  UART_PARITY_Type Parity;        /**< Parity selection, should be:
                               - UART_PARITY_NONE: No parity
                               - UART_PARITY_ODD: Odd parity
                               - UART_PARITY_EVEN: Even parity
                               - UART_PARITY_SP_1: Forced "1" stick parity
                               - UART_PARITY_SP_0: Forced "0" stick parity
                               */
  UART_DATABIT_Type Databits;   /**< Number of data bits, should be:
                               - UART_DATABIT_5: UART 5 bit data mode
                               - UART_DATABIT_6: UART 6 bit data mode
                               - UART_DATABIT_7: UART 7 bit data mode
                               - UART_DATABIT_8: UART 8 bit data mode
                               */
  UART_STOPBIT_Type Stopbits;   /**< Number of stop bits, should be:
                               - UART_STOPBIT_1: UART 1 Stop Bits Select
                               - UART_STOPBIT_2: UART 2 Stop Bits Select
                               */
} UART_CFG_Type;

