RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.h
/********************************************************************//**
* @brief UART FIFO Configuration Structure definition
**********************************************************************/

typedef struct {
    FunctionalState FIFO_ResetRxBuf;    /**< Reset Rx FIFO command state , should be:
                                         - ENABLE: Reset Rx FIFO in UART
                                         - DISABLE: Do not reset Rx FIFO  in UART
                                         */
    FunctionalState FIFO_ResetTxBuf;    /**< Reset Tx FIFO command state , should be:
                                         - ENABLE: Reset Tx FIFO in UART
                                         - DISABLE: Do not reset Tx FIFO  in UART
                                         */
    FunctionalState FIFO_DMAMode;        /**< DMA mode, should be:
                                         - ENABLE: Enable DMA mode in UART
                                         - DISABLE: Disable DMA mode in UART
                                         */
    UART_FITO_LEVEL_Type FIFO_Level;    /**< Rx FIFO trigger level, should be:
                                        - UART_FIFO_TRGLEV0: UART FIFO trigger level 0: 1 character
                                        - UART_FIFO_TRGLEV1: UART FIFO trigger level 1: 4 character
                                        - UART_FIFO_TRGLEV2: UART FIFO trigger level 2: 8 character
                                        - UART_FIFO_TRGLEV3: UART FIFO trigger level 3: 14 character
                                        */
} UART_FIFO_CFG_Type;

/********************************************************************//**
* @brief UART1 Full modem -  RS485 Control configuration type
**********************************************************************/
typedef struct {
    FunctionalState NormalMultiDropMode_State; /*!< Normal MultiDrop mode State:
                                                    - ENABLE: Enable this function.
                                                    - DISABLE: Disable this function. */
    FunctionalState Rx_State;                    /*!< Receiver State:
                                                    - ENABLE: Enable Receiver.
                                                    - DISABLE: Disable Receiver. */
    FunctionalState AutoAddrDetect_State;        /*!< Auto Address Detect mode state:
                                                - ENABLE: ENABLE this function.
                                                - DISABLE: Disable this function. */
    FunctionalState AutoDirCtrl_State;            /*!< Auto Direction Control State:
                                                - ENABLE: Enable this function.
                                                - DISABLE: Disable this function. */
    UART_RS485_DIRCTRL_PIN_Type DirCtrlPin;        /*!< If direction control is enabled, state:
                                                - UART1_RS485_DIRCTRL_RTS:
                                                pin RTS is used for direction control.
                                                - UART1_RS485_DIRCTRL_DTR:
                                                pin DTR is used for direction control. */
     SetState DirCtrlPol_Level;                    /*!< Polarity of the direction control signal on
                                                the RTS (or DTR) pin:
                                                - RESET: The direction control pin will be driven
                                                to logic "0" when the transmitter has data to be sent.
                                                - SET: The direction control pin will be driven
                                                to logic "1" when the transmitter has data to be sent. */
    uint8_t MatchAddrValue;                    /*!< address match value for RS-485/EIA-485 mode, 8-bit long */
    uint8_t DelayValue;                        /*!< delay time is in periods of the baud clock, 8-bit long */
} UART1_RS485_CTRLCFG_Type;

/**
 * @}
 */


/* Public Functions ----------------------------------------------------------- */
/** @defgroup UART_Public_Functions UART Public Functions
 * @{
 */
/* UART Init/DeInit functions --------------------------------------------------*/
void UART_Init(LPC_UART_TypeDef *UARTx, UART_CFG_Type *UART_ConfigStruct);
void UART_DeInit(LPC_UART_TypeDef* UARTx);
void UART_ConfigStructInit(UART_CFG_Type *UART_InitStruct);

/* UART Send/Receive functions -------------------------------------------------*/
void UART_SendByte(LPC_UART_TypeDef* UARTx, uint8_t Data);
uint8_t UART_ReceiveByte(LPC_UART_TypeDef* UARTx);
uint32_t UART_Send(LPC_UART_TypeDef *UARTx, uint8_t *txbuf,
        uint32_t buflen, TRANSFER_BLOCK_Type flag);
uint32_t UART_Receive(LPC_UART_TypeDef *UARTx, uint8_t *rxbuf, \
        uint32_t buflen, TRANSFER_BLOCK_Type flag);

/* UART FIFO functions ----------------------------------------------------------*/
void UART_FIFOConfig(LPC_UART_TypeDef *UARTx, UART_FIFO_CFG_Type *FIFOCfg);
void UART_FIFOConfigStructInit(UART_FIFO_CFG_Type *UART_FIFOInitStruct);

/* UART get information functions -----------------------------------------------*/
uint32_t UART_GetIntId(LPC_UART_TypeDef* UARTx);
uint8_t UART_GetLineStatus(LPC_UART_TypeDef* UARTx);

/* UART operate functions -------------------------------------------------------*/
void UART_IntConfig(LPC_UART_TypeDef *UARTx, UART_INT_Type UARTIntCfg, \
                FunctionalState NewState);
void UART_TxCmd(LPC_UART_TypeDef *UARTx, FunctionalState NewState);
FlagStatus UART_CheckBusy(LPC_UART_TypeDef *UARTx);
void UART_ForceBreak(LPC_UART_TypeDef* UARTx);

/* UART Auto-baud functions -----------------------------------------------------*/
void UART_ABClearIntPending(LPC_UART_TypeDef *UARTx, UART_ABEO_Type ABIntType);
void UART_ABCmd(LPC_UART_TypeDef *UARTx, UART_AB_CFG_Type *ABConfigStruct, \
                FunctionalState NewState);

/* UART1 FullModem functions ----------------------------------------------------*/
void UART_FullModemForcePinState(LPC_UART1_TypeDef *UARTx, UART_MODEM_PIN_Type Pin, \
                            UART1_SignalState NewState);
void UART_FullModemConfigMode(LPC_UART1_TypeDef *UARTx, UART_MODEM_MODE_Type Mode, \
                            FunctionalState NewState);
uint8_t UART_FullModemGetStatus(LPC_UART1_TypeDef *UARTx);

/* UART RS485 functions ----------------------------------------------------------*/
void UART_RS485Config(LPC_UART_TypeDef *UARTx,
                                    UART1_RS485_CTRLCFG_Type *RS485ConfigStruct);
void UART_RS485ReceiverCmd(LPC_UART_TypeDef *UARTx, FunctionalState NewState);
void UART_RS485SendSlvAddr(LPC_UART_TypeDef *UARTx, uint8_t SlvAddr);
uint32_t UART_RS485SendData(LPC_UART_TypeDef *UARTx, uint8_t *pData, uint32_t size);

/* UART IrDA functions-------------------------------------------------------------*/
void UART_IrDAInvtInputCmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState);
void UART_IrDACmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState);
void UART_IrDAPulseDivConfig(LPC_UART_TypeDef *UARTx, UART_IrDA_PULSE_Type PulseDiv);
/**
 * @}
 */


#ifdef __cplusplus
}
#endif


#endif /* __LPC177X_8X_UART_H_ */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
